pimpleFoamCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(sideWalls|bottom|pier)"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    top
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    inletWater
    {
        type            zeroGradient;
    }

    outletWater
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
